print("Python არის მაღალი დონის, მულტიპლატფორმული, დინამიური პროგრამირების ენა, რომელიც ფართოდ გამოიყენება თანამედროვე ტექნოლოგიურ სამყაროში. იგი შექმნა ნიდერლანდელმა პროგრამისტმა გიდო ვან როსუმ. Python-ის შექმნის მიზანი იყო ისეთი ენის ჩამოყალიბება, რომელიც იქნებოდა მარტივად გასაგები და მკაფიო სინტაქსის მქონე")
print("ენის ერთ-ერთი გამორჩეული მახასიათებელია ბლოკების განსაზღვრა აბზაცებით ნაცვლად ფიგურული ფრჩხილებისა, რაც პროგრამის ვიზუალურ სტრუქტურას პირდაპირ აკავშირებს მის ლოგიკურ სტრუქტურასთან. ეს მიდგომა მნიშვნელოვნად ამცირებს სინტაქსურ შეცდომებს.")
print("Python ინტერპრეტირებული ენაა. მისი ინტერპრეტატორი წარმოადგენს ვირტუალურ მანქანას, რომელიც წყაროს კოდს ბაიტ-კოდად გარდაქმნის და შემდეგ ასრულებს. პროგრამის გაშვებისას ინტერპრეტატორი ამოწმებს, არსებობს თუ არა უკვე შექმნილი ბაიტ-კოდი და, საჭიროების შემთხვევაში, ხელახლა ქმნის მას. ეს მექანიზმი უზრუნველყოფს ეფექტურობას და ამავე დროს ინარჩუნებს ენის მოქნილობას")
print("ენა მულტიპარადიგმულია და აერთიანებს პროცედურულ, იმპერატიულ და ფუნქციონალურ პროგრამირების ელემენტებს. Python-ში ფუნქციები გამოძახებადი ობიექტებია, რომელთაც გააჩნიათ საკუთარი ატრიბუტები, ასევე შესაძლებელია ოპერატორების ხელახალი განსაზღვრა. Python აგრეთვე არის ღია კოდის მქონე ენა, მისი გამოყენება და განვითარება შეუძლია ნებისმიერ მსურველს, რაც ხელს უწყობს მისი სწრაფი განვითარების პროცესს")
print("Python-ის ერთ-ერთი უპირატესობაა მისი დიდი და მრავლისმომცველი სტანდარტული ბიბლიოთეკაა. ის მოიცავს მოდულებს ქსელური პროგრამირებისთვის, ვებ-სერვისებისთვის, მონაცემთა ბაზებთან მუშაობისთვის, ტექსტის დამუშავებისა და ტესტირებისთვის.")
print("Python-ის მეხსიერება იმართება ავტომატურად garbage collector-ის მეშვეობით, თუმცა, პაითონის კლასებს აქვთ დესტრუქტორი, რომლის გამოძახება შესაძლებელია ნებისმიერ დროს. შეცდომებზე რეაგირება ხდება პროგრამულად try-except-else-finally ბლოკის გამოყენებით.")
# print() ფუნქცია გამოიყენება ბრძანების ეკრანზე გამოსატანად


age1= 16
age2= 17

print(age1)
print(age2)


place = "GOA"
feeling = " is "
adjective = "amazing"

print(place + feeling + adjective)
         



    